Revit 2024 API
UIControlledApplication.LoadedApplications Property
 Returns an array of successfully loaded external applications.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ExternalApplicationArray LoadedApplications { get; }
Visual Basic
Public Overridable ReadOnly Property LoadedApplications As ExternalApplicationArray
	Get
Visual C++
public:
virtual property ExternalApplicationArray^ LoadedApplications {
	ExternalApplicationArray^ get ();
}
Remarks
 This property can be used by your application to find all successfully loaded external applications when Revit starts.
See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace